{"class_name": "Model", "keras_version": "1.1.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 30, 30, 4], "input_dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "convolution2d_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 8, "subsample": [4, 4], "init": "uniform", "bias": true, "nb_filter": 32, "input_dtype": "float32", "border_mode": "same", "batch_input_shape": [null, 30, 30, 4], "W_regularizer": null, "activation": "relu", "nb_row": 8}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "convolution2d_1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 4, "subsample": [2, 2], "init": "uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 4}, "inbound_nodes": [[["convolution2d_1", 0, 0]]], "name": "convolution2d_2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_3", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [2, 2], "init": "uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["convolution2d_2", 0, 0]]], "name": "convolution2d_3"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["convolution2d_3", 0, 0]]], "name": "flatten_1"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 32}, "inbound_nodes": [[["flatten_1", 0, 0]]], "name": "dense_1"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_3", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 32}, "inbound_nodes": [[["flatten_1", 0, 0]]], "name": "dense_3"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 1}, "inbound_nodes": [[["dense_1", 0, 0]]], "name": "dense_2"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_4", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 5}, "inbound_nodes": [[["dense_3", 0, 0]]], "name": "dense_4"}, {"class_name": "Lambda", "config": {"function": ["c\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0004\u0000\u0000\u0000S\u0000\u0000\u0000s#\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000d\u0001\u0000f\u0002\u0000\u0019d\u0002\u0000d\u0003\u0000\u0083\u0001\u0001S(\u0004\u0000\u0000\u0000Ni\u0000\u0000\u0000\u0000t\u0003\u0000\u0000\u0000dimi\u00ff\u00ff\u00ff\u00ff(\u0002\u0000\u0000\u0000t\u0001\u0000\u0000\u0000Kt\u000b\u0000\u0000\u0000expand_dims(\u0001\u0000\u0000\u0000t\u0001\u0000\u0000\u0000s(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u0018\u0000\u0000\u0000train_agent_duel_ddqn.pyt\b\u0000\u0000\u0000<lambda>E\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": [5], "output_shape_type": "raw"}, "inbound_nodes": [[["dense_2", 0, 0]]], "name": "lambda_1"}, {"class_name": "Lambda", "config": {"function": ["c\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0006\u0000\u0000\u0000S\u0000\u0000\u0000sC\u0000\u0000\u0000|\u0000\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000f\u0002\u0000\u0019t\u0000\u0000j\u0001\u0000|\u0000\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000f\u0002\u0000\u0019d\u0001\u0000t\u0002\u0000\u0083\u0001\u0001\u0018S(\u0002\u0000\u0000\u0000Nt\b\u0000\u0000\u0000keepdims(\u0003\u0000\u0000\u0000t\u0001\u0000\u0000\u0000Kt\u0004\u0000\u0000\u0000meant\u0004\u0000\u0000\u0000True(\u0001\u0000\u0000\u0000t\u0001\u0000\u0000\u0000a(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u0018\u0000\u0000\u0000train_agent_duel_ddqn.pyt\b\u0000\u0000\u0000<lambda>I\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_2", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": [5], "output_shape_type": "raw"}, "inbound_nodes": [[["dense_4", 0, 0]]], "name": "lambda_2"}, {"class_name": "Merge", "config": {"name": "merge_1", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["lambda_1", 0, 0], ["lambda_2", 0, 0]]], "name": "merge_1"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["merge_1", 0, 0]], "name": "model_1"}}